Rahix/avr-device/vendor/attiny44a.atdf
    <module caption="Lockbits" name="LOCKBIT">
      <register-group caption="Lockbits" name="LOCKBIT">
        <register name="LOCKBIT" offset="0x00" size="1" initval="0xFF">
          <bitfield caption="Memory Lock" mask="0x03" name="LB" values="ENUM_LB"/>
        </register>
      </register-group>
      <value-group name="ENUM_LB">
        <value caption="Further programming and verification disabled" name="PROG_VER_DISABLED" value="0x00"/>
        <value caption="Further programming disabled" name="PROG_DISABLED" value="0x02"/>
        <value caption="No memory lock features enabled" name="NO_LOCK" value="0x03"/>
      </value-group>
    </module>
    <module caption="I/O Port" name="PORT">
      <register-group caption="I/O Port" name="PORTA">
        <register caption="Port A Data Register" name="PORTA" offset="0x3B" size="1" mask="0xFF"/>
        <register caption="Port A Data Direction Register" name="DDRA" offset="0x3A" size="1" mask="0xFF"/>
        <register caption="Port A Input Pins" name="PINA" offset="0x39" size="1" mask="0xFF" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTB">
        <register caption="Data Register, Port B" name="PORTB" offset="0x38" size="1" mask="0x0F"/>
        <register caption="Data Direction Register, Port B" name="DDRB" offset="0x37" size="1" mask="0x0F"/>
        <register caption="Input Pins, Port B" name="PINB" offset="0x36" size="1" mask="0x0F" ocd-rw="R"/>
      </register-group>
    </module>
    <module caption="Analog Comparator" name="AC">
      <register-group caption="Analog Comparator" name="AC">
        <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x23" size="1">
          <bitfield caption="Analog Comparator Multiplexer Enable" mask="0x40" name="ACME"/>
        </register>
        <register caption="Analog Comparator Control And Status Register" name="ACSR" offset="0x28" size="1" ocd-rw="R">
          <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
          <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
          <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
          <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
          <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
          <bitfield caption="Analog Comparator Input Capture Enable" mask="0x04" name="ACIC"/>
          <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS" values="ANALOG_COMP_INTERRUPT"/>
        </register>
        <register name="DIDR0" offset="0x21" size="1">
          <bitfield caption="ADC 1 Digital input buffer disable" mask="0x02" name="ADC1D"/>
          <bitfield caption="ADC 0 Digital input buffer disable" mask="0x01" name="ADC0D"/>
        </register>
      </register-group>
      <value-group name="ANALOG_COMP_INTERRUPT">
        <value caption="Interrupt on Toggle" name="INTERRUPT_ON_TOGGLE" value="0x00"/>
        <value caption="Reserved" name="RESERVED" value="0x01"/>
        <value caption="Interrupt on Falling Edge" name="INTERRUPT_ON_FALLING_EDGE" value="0x02"/>
        <value caption="Interrupt on Rising Edge" name="INTERRUPT_ON_RISING_EDGE" value="0x03"/>
      </value-group>
    </module>
    <module caption="Analog-to-Digital Converter" name="ADC">
      <register-group caption="Analog-to-Digital Converter" name="ADC">
        <register caption="ADC Multiplexer Selection Register" name="ADMUX" offset="0x27" size="1" mask="0xFF">
          <bitfield caption="Reference Selection Bits" mask="0xC0" name="REFS" values="ANALOG_ADC_V_REF"/>
          <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x3F" name="MUX"/>
        </register>
        <register caption="ADC Control and Status Register A" name="ADCSRA" offset="0x26" size="1" ocd-rw="R">
          <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
          <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
          <bitfield caption="ADC Auto Trigger Enable" mask="0x20" name="ADATE"/>
          <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
          <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
          <bitfield caption="ADC  Prescaler Select Bits" mask="0x07" name="ADPS" values="ANALOG_ADC_PRESCALER"/>
        </register>
        <register caption="ADC Data Register  Bytes" name="ADC" offset="0x24" size="2" mask="0xFFFF"/>
        <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x23" size="1">
          <bitfield caption="Bipolar Input Mode" mask="0x80" name="BIN"/>
          <bitfield caption="ADC Left Adjust Result" mask="0x10" name="ADLAR"/>
          <bitfield caption="ADC Auto Trigger Source bits" mask="0x07" name="ADTS" values="ANALOG_ADC_AUTO_TRIGGER"/>
        </register>
        <register caption="Digital Input Disable Register 0" name="DIDR0" offset="0x21" size="1" mask="0xFF"/>
      </register-group>
      <value-group name="ANALOG_ADC_V_REF">
        <value caption="VCC used as analog reference, disconnected from PA0 (AREF)" name="VCC_USED_AS_ANALOG_REFERENCE_DISCONNECTED_FROM_PA0_AREF" value="0x00"/>
        <value caption="External voltage reference at PA0 (AREF) pin, internal reference turned off" name="EXTERNAL_VOLTAGE_REFERENCE_AT_PA0_AREF_PIN_INTERNAL_REFERENCE_TURNED_OFF" value="0x01"/>
        <value caption="Internal 1.1V voltage reference" name="INTERNAL_1_1V_VOLTAGE_REFERENCE" value="0x02"/>
        <value caption="Reserved" name="RESERVED" value="0x03"/>
      </value-group>
      <value-group name="ANALOG_ADC_PRESCALER">
        <value caption="2" name="2" value="0x00"/>
        <value caption="2" name="2" value="0x01"/>
        <value caption="4" name="4" value="0x02"/>
        <value caption="8" name="8" value="0x03"/>
        <value caption="16" name="16" value="0x04"/>
        <value caption="32" name="32" value="0x05"/>
        <value caption="64" name="64" value="0x06"/>
        <value caption="128" name="128" value="0x07"/>
      </value-group>
