Rahix/avr-device/vendor/attiny44a.atdf
      <value-group name="ANALOG_ADC_AUTO_TRIGGER">
        <value caption="Free Running mode" name="FREE_RUNNING_MODE" value="0x00"/>
        <value caption="Analog Comparator" name="ANALOG_COMPARATOR" value="0x01"/>
        <value caption="External Interrupt Request 0" name="EXTERNAL_INTERRUPT_REQUEST_0" value="0x02"/>
        <value caption="Timer/Counter0 Compare Match A" name="TIMER_COUNTER0_COMPARE_MATCH_A" value="0x03"/>
        <value caption="Timer/Counter0 Overflow" name="TIMER_COUNTER0_OVERFLOW" value="0x04"/>
        <value caption="Timer/Counter1 Compare Match B" name="TIMER_COUNTER1_COMPARE_MATCH_B" value="0x05"/>
        <value caption="Timer/Counter1 Overflow" name="TIMER_COUNTER1_OVERFLOW" value="0x06"/>
        <value caption="Timer/Counter1 Capture Event" name="TIMER_COUNTER1_CAPTURE_EVENT" value="0x07"/>
      </value-group>
    </module>
    <module caption="Universal Serial Interface" name="USI">
      <register-group caption="Universal Serial Interface" name="USI">
        <register caption="USI Buffer Register" name="USIBR" offset="0x30" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="USI Data Register" name="USIDR" offset="0x2F" size="1" mask="0xFF"/>
        <register caption="USI Status Register" name="USISR" offset="0x2E" size="1" ocd-rw="R">
          <bitfield caption="Start Condition Interrupt Flag" mask="0x80" name="USISIF"/>
          <bitfield caption="Counter Overflow Interrupt Flag" mask="0x40" name="USIOIF"/>
          <bitfield caption="Stop Condition Flag" mask="0x20" name="USIPF"/>
          <bitfield caption="Data Output Collision" mask="0x10" name="USIDC"/>
          <bitfield caption="USI Counter Value Bits" mask="0x0F" name="USICNT"/>
        </register>
        <register caption="USI Control Register" name="USICR" offset="0x2D" size="1">
          <bitfield caption="Start Condition Interrupt Enable" mask="0x80" name="USISIE"/>
          <bitfield caption="Counter Overflow Interrupt Enable" mask="0x40" name="USIOIE"/>
          <bitfield caption="USI Wire Mode Bits" mask="0x30" name="USIWM" values="COMM_USI_OP"/>
          <bitfield caption="USI Clock Source Select Bits" mask="0x0C" name="USICS"/>
          <bitfield caption="Clock Strobe" mask="0x02" name="USICLK"/>
          <bitfield caption="Toggle Clock Port Pin" mask="0x01" name="USITC"/>
        </register>
      </register-group>
      <value-group name="COMM_USI_OP">
        <value caption="Normal Operation" name="NORMAL_OPERATION" value="0x00"/>
        <value caption="Three-Wire Mode" name="THREE_WIRE_MODE" value="0x01"/>
        <value caption="Two-Wire Mode" name="TWO_WIRE_MODE" value="0x02"/>
        <value caption="Two-Wire Mode Held Low" name="TWO_WIRE_MODE_HELD_LOW" value="0x03"/>
      </value-group>
    </module>
    <module caption="External Interrupts" name="EXINT">
      <register-group caption="External Interrupts" name="EXINT">
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="Interrupt Sense Control 0" mask="0x03" name="ISC0" values="INTERRUPT_SENSE_CONTROL"/>
        </register>
        <register caption="General Interrupt Mask Register" name="GIMSK" offset="0x5B" size="1">
          <bitfield caption="External Interrupt Request 0 Enable" mask="0x40" name="INT0"/>
          <bitfield caption="Pin Change Interrupt Enables" mask="0x30" name="PCIE"/>
        </register>
        <register caption="General Interrupt Flag register" name="GIFR" offset="0x5A" size="1" ocd-rw="R">
          <bitfield caption="External Interrupt Flag 0" mask="0x40" name="INTF0"/>
          <bitfield caption="Pin Change Interrupt Flags" mask="0x30" name="PCIF"/>
        </register>
        <register caption="Pin Change Enable Mask 1" name="PCMSK1" offset="0x40" size="1" mask="0x0F"/>
        <register caption="Pin Change Enable Mask 0" name="PCMSK0" offset="0x32" size="1" mask="0xFF"/>
      </register-group>
      <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
        <value caption="Low Level of INTX" name="LOW_LEVEL_OF_INTX" value="0x00"/>
        <value caption="Any Logical Change of INTX" name="ANY_LOGICAL_CHANGE_OF_INTX" value="0x01"/>
        <value caption="Falling Edge of INTX" name="FALLING_EDGE_OF_INTX" value="0x02"/>
        <value caption="Rising Edge of INTX" name="RISING_EDGE_OF_INTX" value="0x03"/>
      </value-group>
    </module>
    <module caption="EEPROM" name="EEPROM">
      <register-group caption="EEPROM" name="EEPROM">
        <register caption="EEPROM Address Register  Bytes" name="EEAR" offset="0x3E" size="2" mask="0x01FF"/>
        <register caption="EEPROM Data Register" name="EEDR" offset="0x3D" size="1" mask="0xFF"/>
        <register caption="EEPROM Control Register" name="EECR" offset="0x3C" size="1">
          <bitfield caption="EEPROM Programming Mode Bits" mask="0x30" name="EEPM" values="EEP_MODE"/>
          <bitfield caption="EEPROM Ready Interrupt Enable" mask="0x08" name="EERIE"/>
          <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMPE"/>
          <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEPE"/>
          <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
        </register>
      </register-group>
      <value-group name="EEP_MODE">
        <value caption="Erase and Write in one operation" name="ERASE_AND_WRITE_IN_ONE_OPERATION" value="0x00"/>
        <value caption="Erase Only" name="ERASE_ONLY" value="0x01"/>
        <value caption="Write Only" name="WRITE_ONLY" value="0x02"/>
      </value-group>
    </module>
    <module caption="Watchdog Timer" name="WDT">
      <register-group caption="Watchdog Timer" name="WDT">
        <register caption="Watchdog Timer Control Register" name="WDTCSR" offset="0x41" size="1" ocd-rw="R">
          <bitfield caption="Watchdog Timeout Interrupt Flag" mask="0x80" name="WDIF"/>
          <bitfield caption="Watchdog Timeout Interrupt Enable" mask="0x40" name="WDIE"/>
          <bitfield caption="Watchdog Timer Prescaler Bits" mask="0x27" name="WDP" values="WDOG_TIMER_PRESCALE_4BITS"/>
          <bitfield caption="Watchdog Change Enable" mask="0x10" name="WDCE"/>
          <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
        </register>
      </register-group>
      <value-group name="WDOG_TIMER_PRESCALE_4BITS">
        <value caption="Oscillator Cycles 2K" name="OSCILLATOR_CYCLES_2K" value="0x00"/>
        <value caption="Oscillator Cycles 4K" name="OSCILLATOR_CYCLES_4K" value="0x01"/>
        <value caption="Oscillator Cycles 8K" name="OSCILLATOR_CYCLES_8K" value="0x02"/>
        <value caption="Oscillator Cycles 16K" name="OSCILLATOR_CYCLES_16K" value="0x03"/>
        <value caption="Oscillator Cycles 32K" name="OSCILLATOR_CYCLES_32K" value="0x04"/>
        <value caption="Oscillator Cycles 64K" name="OSCILLATOR_CYCLES_64K" value="0x05"/>
        <value caption="Oscillator Cycles 128K" name="OSCILLATOR_CYCLES_128K" value="0x06"/>
        <value caption="Oscillator Cycles 256K" name="OSCILLATOR_CYCLES_256K" value="0x07"/>
        <value caption="Oscillator Cycles 512K" name="OSCILLATOR_CYCLES_512K" value="0x08"/>
        <value caption="Oscillator Cycles 1024K" name="OSCILLATOR_CYCLES_1024K" value="0x09"/>
      </value-group>
    </module>
    <module caption="Timer/Counter, 8-bit" name="TC8">
      <register-group caption="Timer/Counter, 8-bit" name="TC0">
        <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK0" offset="0x59" size="1">
          <bitfield caption="Timer/Counter0 Output Compare Match B Interrupt Enable" mask="0x04" name="OCIE0B"/>
          <bitfield caption="Timer/Counter0 Output Compare Match A Interrupt Enable" mask="0x02" name="OCIE0A"/>
          <bitfield caption="Timer/Counter0 Overflow Interrupt Enable" mask="0x01" name="TOIE0"/>
        </register>
